## Задача 1 
Используя замыкания функций, определите вложенную функцию, которая бы увеличивала значение переданного параметра на 5 и возвращала бы вычисленный результат. 

При этом внешняя функция должна иметь следующую сигнатуру:
```python
def counter_add(): ...
```
Вызовите функцию counter_add и результат ее работы присвойте переменной с именем cnt. 

Вызовите внутреннюю функцию через переменную cnt со значением k, введенным с клавиатуры:
```python

def counter_add():
   ...
   

k = int(input())
f = counter_add()
print (f(k))
```
Выведите результат на экран.

## Задача 2 


Используя замыкания функций, объявите внутреннюю функцию, которая увеличивает значение своего аргумента на некоторую величину n - параметр внешней функции с сигнатурой:

```python
def counter_add(n): ...
```

Вызовите внешнюю функцию counter_add со значением аргумента 2 и результат присвойте переменной cnt. Вызовите внутреннюю функцию через переменную cnt со значением k, введенным с клавиатуры:


```python
def counter_add(n):
  ...


k = int(input())
f = counter_add(2)
print(f(k))

```

Выведите результат на экран


## Задача 3 

Используя замыкания функций, объявите внутреннюю функцию, которая заключает в тег h1 строку s (s - строка, параметр внутренней функции). 

Далее, на вход программы поступает строка и ее нужно поместить в тег h1 с помощью реализованного замыкания. Результат выведите на экран.

P. S. Пример добавления тега h1 к строке "Python": <h1>Python</h1>

Sample Input:

Пушкин
Sample Output:

<h1>Пушкин</h1>

```python
def f1():
   ...


s = input()
f = f1()
print(f(s))
```

## Задача 4 

Используя замыкания функций, объявите внутреннюю функцию, которая преобразует строку из списка целых чисел, записанных через пробел, либо в список, либо в кортеж. 

Тип коллекции определяется параметром tp внешней функции. Если tp = 'list', то используется список, иначе (при другом значении) - кортеж.

Далее, на вход программы поступают две строки: первая - это значение для параметра tp; вторая - список целых чисел, записанных через пробел. С помощью реализованного замыкания преобразовать эти данные в соответствующую коллекцию. Результат вывести на экран командой (lst - ссылка на коллекцию):

```python
print(lst)
```
> Входные данные:
```
list
-5 6 8 11 0 111 -456 3
```
Выходные данные:
```
[-5, 6, 8, 11, 0, 111, -456, 3]
```

```python
def parse(...):
    ...

pr = parse(input())
print(pr(input()))

```